line_1 = ['연천','전곡','청산','소요산', '동두천', '보산', '동두천중앙', '지행', '덕정', '덕계', '양주', '녹양', '가능', '의정부',
    '회룡', '망월사', '도봉산', '도봉', '방학', '창동', '녹천', '월계', '광운대', '석계', '신이문',
    '외대앞', '회기', '청량리', '제기동', '신설동', '동묘앞', '동대문', '종로5가', '종로3가', '종각', '시청', '서울역',
    '남영', '용산', '노량진', '대방', '신길', '영등포', '신도림', '구로', '구일', '개봉',
    '오류동', '온수', '역곡', '소사', '부천', '중동', '송내', '부개', '부평', '백운', '동암',
    '간석', '주안', '도화', '제물포', '도원', '동인천', '인천',
    '노량진', '대방', '신길', '영등포', '신도림', '구로',
    '가산디지털단지', '독산', '금천구청', '광명', '석수', '관악', '안양', '명학', '금정', '군포',
    '당정', '의왕', '성균관대', '화서', '수원', '세류', '병점', '세마', '오산대', '오산', '진위',
    '송탄', '서정리', '평택', '성환', '직산', '두정', '천안', '봉명', '쌍용(나사렛대)', '아산', '배방', '온양온천', '신창'
]

line_3 = [
    '대화', '주엽', '정발산', '마두', '백석', '대곡', '화정', '원당', '원흥', '삼송', '지축',
    '구파발', '연신내', '불광', '녹번', '홍제', '무악재', '독립문', '경복궁', '안국', '종로3가',
    '을지로3가', '충무로', '동대입구', '약수', '금호', '옥수', '압구정', '신사', '잠원', '고속터미널',
    '교대', '남부터미널', '양재', '매봉', '도곡', '대치', '학여울', '대청', '일원', '수서',
    '가락시장', '경찰병원', '오금'
]

line_4 = [
    '진접','오남','별내별가람','불암산','상계', '노원', '창동', '쌍문', '수유', '미아', '미아사거리', '길음', '성신여대입구',
    '한성대입구', '혜화', '동대문', '동대문역사문화공원', '충무로', '명동', '회현', '서울역',
    '숙대입구', '삼각지', '신용산', '이촌', '동작', '총신대입구', '사당', '남태령',
    '선바위', '경마공원', '대공원', '과천', '정부과천청사', '인덕원', '평촌', '범계', '금정', '산본',
    '수리산', '대야미', '반월', '상록수', '한대앞', '중앙', '고잔', '초지', '안산', '신길온천',
    '정왕', '오이도'
]

line_6 = [
    '응암', '역촌', '불광', '독바위', '연신내', '구산', '새절', '증산', '디지털미디어시티',
    '월드컵경기장', '마포구청', '망원', '합정', '상수', '광흥창', '대흥', '공덕', '효창공원앞',
    '삼각지', '녹사평', '이태원', '한강진', '버티고개', '약수', '청구', '신당', '동묘앞', '창신',
    '보문', '안암', '고려대', '월곡', '상월곡', '돌곶이', '석계', '태릉입구', '화랑대', '봉화산',
    '신내'
]

stations=line_1+line_3+line_4+line_6